import { Job } from "./Job";
import { Person } from "./Person";


console.log('index Job', Job);
console.log('index Job', Job);


// * проверка
/**
 * Для проверки работы приложения

- Создайте 2-3 экземпляра класса Person, назначьте им имя.
- Создайте несколько объектов типа Job, задав им название профессии и роль.
- Задайте вашим сотрудникам первоначальные профессии и заставьте их немного поработать.
- Переквалифицируйте работников на другую профессию.

Person может работать с любым Job, который он получает снаружи.
 */
const personOne = new Person('Кирилл');
const personTwo = new Person('Сергей');




